lib/active_shipping/shipping/carriers/fedex/templates/quote.xml.erb

<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns='http://fedex.com/ws/rate/v13'>
  <soapenv:Header/>
  <soapenv:Body>
    <RateRequest>
      <WebAuthenticationDetail>
        <UserCredential>
          <Key><%= @key %></Key>
          <Password><%= @password %></Password>
        </UserCredential>
      </WebAuthenticationDetail>
      <ClientDetail>
        <AccountNumber><%= @accountNumber %></AccountNumber>
        <MeterNumber><%= @meterNumber %></MeterNumber>
      </ClientDetail>
      <Version>
        <ServiceId>crs</ServiceId>
        <Major>13</Major>
        <Intermediate>0</Intermediate>
        <Minor>0</Minor>
      </Version>
      <ReturnTransitAndCommit>true</ReturnTransitAndCommit>
      <VariableOptions>SATURDAY_DELIVERY</VariableOptions>
      <RequestedShipment>
        <ShipTimestamp><%= Time.now.utc.iso8601(2) %></ShipTimestamp>
        <DropoffType>REGULAR_PICKUP</DropoffType>
        <PackagingType><%= @packagingType %></PackagingType>
        <% if @preferred_currency %>
          <PreferredCurrency><%= @preferred_currency %></PreferredCurrency>
        <% end %>
        <% if @insured_value && @insured_currency %>
          <TotalInsuredValue>
            <Currency><%= @insured_currency %></Currency>
            <Amount><%= @insured_value %></Amount>            
          </TotalInsuredValue>
        <% end %>        
        <Shipper>
          <Address>
            <PostalCode><%= @shipper_postalcode %></PostalCode>
            <CountryCode><%= @shipper_countrycode %></CountryCode>
          </Address>
        </Shipper>
        <Recipient>
          <Address>
            <PostalCode><%= @recipient_postalcode %></PostalCode>
            <CountryCode><%= @recipient_countrycode %></CountryCode>
            <Residential>true</Residential>
          </Address>
        </Recipient>
        <RateRequestTypes>LIST</RateRequestTypes>
        <PackageCount><%= @package_count %></PackageCount>
        <% if @packages %>
          <RequestedPackageLineItems>                    
            <% @packages.each do |package| -%>
              <GroupPackageCount><%= package.quantity %></GroupPackageCount>
              <Weight>
                <Units>KG</Units>
                <Value><%= package.weight -%></Value>
              </Weight>
              <Dimensions>
                <Length><%= package.length -%></Length>
                <Width><%= package.width -%></Width>
                <Height><%= package.height -%></Height>
                <Units>CM</Units>
              </Dimensions>            
            <% end -%>
          </RequestedPackageLineItems>
        <% end -%>                                  
      </RequestedShipment>
    </RateRequest>
  </soapenv:Body>
</soapenv:Envelope>